Repository: ngraaiyo/sibwesa_primary_school
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: Home
sw: Nyumbani

source: Language
sw: Lugha

source: English
sw: Kingereza

source: May
sw: Mei

source: Admin Dashboard
sw: Dashibodi ya Msimamizi

source: Teacher Dashboard
sw: Dashibodi ya Mwalimu

source: Student Dashboard
sw: Dashibodi ya Msimamizi

source: Profile
sw: Wasifu

source: Logout
sw: Toka

source: Messages
sw: Ujumbe

source: Site Maps
sw: Ramani za Tovuti

source: Static Files
sw: Faili Sthiriki

source: Syndication
sw: Usambazaji

source: That page number is not an integer
sw: Nambari ya ukurasa si nambari kamili

source: That page number is less than 1
sw: Nambari ya ukurasa ni chini ya 1

source: That page contains no results
sw: Ukurasa huu hau na matokeo

source: Enter a valid value.
sw: Ingiza thamani sahihi.

source: Enter a valid domain name.
sw: Ingiza jina sahihi la kikoa.

source: Enter a valid URL.
sw: Ingiza URL sahihi.

source: Enter a valid integer.
sw: Ingiza nambari kamili sahihi.

source: Enter a valid email address.
sw: Ingiza anuani sahihi ya barua pepe.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
sw: Ingiza 'slug' sahihi inayojumuisha herufi, namba, mstari chini au alama ya kipande.

source: Enter a valid "slug" consisting of Unicode letters, numbers, underscores, or hyphens.
sw: Ingiza 'slug' sahihi inayojumuisha herufi za Unicode, namba, mstari chini,au alama ya kipande.

source: Enter a valid %(protocol)s address.
sw: Ingiza anwani sahihi ya %(protocol)s.

source: IPv4 or IPv6
sw: IPv4 au IPv6

source: Enter only digits separated by commas.
sw: Ingiza namba pekee zilizotenganishwa kwa koma.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
sw: Hakikisha thamani hii ni %(limit_value)s (ni %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
sw: Hakikisha thamani hii ni ndogo au sawa na %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
sw: Hakikisha thamani hii ni kubwa au sawa na %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
sw: Hakikisha thamani hii ni nyingi za kipimo %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
sw: Hakikisha thamani hii ni nyingi za kipimo %(limit_value)s, kuanzia %(offset)s, mfano %(offset)s, %(valid_value1)s, %(valid_value2)s, na kadhalika.

source: Ensure this value has at least.
sw: Hakikisha thamani hii ina angalau herufi.

source: Ensure this value has at most character
sw: Hakikisha thamani hii haizidi herufi.

source: Enter a number.
sw: Ingiza nambari.

source: Ensure that there are no more than %(max)s digit in total.
sw: Hakikisha kwamba kuna namba zisizozidi %(max)s jumla.

source: Ensure that there are no more than %(max)s decimal place.
sw: Hakikisha hakuna zaidi ya sehemu desimali %(max)s.

source: Ensure that there are no more than %(max)s digit before the decimal point.
sw: Hakikisha hakuna zaidi ya namba %(max)s kabla ya nukta desimali.

source: File extension “%(extension)s” is not allowed. Allowed extensions are:
sw: Ongeza faili “%(extension)s” hairuhusiwi. Ongeza faili zinazokubalika ni

source: Null characters are not allowed.
sw: Herufi zisizo na maana haziruhusiwi.

source: and
sw: na

source: %(model_name)s with this %(field_labels)s already exists.
sw: %(model_name)s yenye %(field_labels)s tayari ipo.

source: Constraint “%(name)s” is violated.
sw: Kizuizi “%(name)s” kimevunjika.

source: Value %(value)r is not a valid choice.
sw: Thamani %(value)r si chaguo sahihi.

source: This field cannot be null.
sw: Sehemu hii haiwezi kuwa tupu.

source: This field cannot be blank.
sw: Sehemu hii haiwezi kuwa tupu.

source: %(model_name)s with this %(field_label)s already exists.
sw: %(model_name)s yenye %(field_label)s tayari ipo.

source: must be unique for %(date_field_label)s %(lookup_type)s.
sw: lazima iwe ya kipekee kwa %(date_field_label)s

source: Field of type: %(field_type)s
sw: Sehemu ya aina: %(field_type)s

source: "“%(value)s” value must be either True or False.
sw: Thamani "“%(value)s” lazima iwe True au False.

source: “%(value)s” value must be either True, False, or None.
sw: Thamani "“%(value)s” lazima iwe True, False, au None.

source: Boolean (Either True or False)
sw: Boolean (True au False)

source: String (up to %(max_length)s)
sw: Utaratibu (hadi %(max_length)s)

source: String (unlimited)
sw: Utaratibu (usio na kikomo)

source: Comma-separated integers
sw: Nambari zilizotenganishwa kwa koma

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
sw: Thamani “%(value)s” ina muundo wa tarehe usio sahihi. Inapaswa kuwa katika muundo wa YYYY-MM-DD.

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
sw: Thamani “%(value)s” ina muundo sahihi (YYYY-MM-DD) lakini ni tarehe isiyo halali.

source: Date (without time)
sw: Tarehe (bila wakati)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
sw: Thamani “%(value)s” ina muundo usio sahihi. Inapaswa kuwa katika muundo wa YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ].

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]] [TZ]) but it is an invalid date/time.
sw: Thamani “%(value)s” ina muundo sahihi (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) lakini ni tarehe/waqt isiyo halali.

source: Date (with time)
sw: Tarehe (na wakati)

source: “%(value)s” value must be a decimal number.
sw: Thamani “%(value)s” lazima iwe namba ya desimali.

source: Decimal number
sw: Namba ya desimali

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
sw: Thamani “%(value)s” ina muundo usio sahihi. Inapaswa kuwa katika muundo wa [DD] [[HH:]MM:]ss[.uuuuuu].

source: Duration
sw: Muda

source: Email address
sw: Anuani ya barua pepe

source: File path
sw: Njia ya faili

source: “%(value)s” value must be a float.
sw: Thamani “%(value)s” lazima iwe namba ya kompyuta ya kuzunguka (float).

source: Floating point number
sw: Namba ya kompyuta ya kuzunguka (float)

source: “%(value)s” value must be an integer.
sw: Thamani “%(value)s” lazima iwe nambari kamili.

source: Integer
sw: Nambari kamili

source: Big (8 byte) integer
sw: Nambari kamili kubwa (8 bytes)

source: Small integer
sw: Nambari kamili ndogo

source: IPv4 address
sw: Anwani ya IPv4

source: IP address
sw: Anwani ya IP

source: “%(value)s” value must be either None, True or False.
sw: Thamani “%(value)s” lazima iwe None, True, au False.

source: Boolean (Either True, False or None)
sw: Boolean (True, False, au None)

source: Positive big integer
sw: Nambari kamili kubwa chanya

source: Positive integer
sw: Nambari kamili chanya

source: Positive small integer
sw: Nambari kamili ndogo chanya

source: Slug (up to %(max_length)s)
sw: Slug (hadi %(max_length)s)

source: Text
sw: Maandishi

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
sw: Thamani “%(value)s” ina muundo usio sahihi. Inapaswa kuwa katika muundo wa HH:MM[:ss[.uuuuuu]].

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
sw: Thamani “%(value)s” ina muundo sahihi (HH:MM[:ss[.uuuuuu]]) lakini ni wakati usio halali.

source: Time
sw: Wakati

source: Raw binary data
sw: Data ya binary ghafi

source: “%(value)s” is not a valid UUID.
sw: “%(value)s” si UUID sahihi.

source: Universally unique identifier
sw: Kitambulisho cha kipekee duniani (UUID)

source: File
sw: Faili

source: Image
sw: Picha

source: A JSON object
sw: Kitu cha JSON

source: Value must be valid JSON.
sw: Thamani lazima iwe JSON sahihi.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
sw: Mfano wa %(model)s wenye %(field)s %(value)r si chaguo sahihi.

source: Foreign Key (type determined by related field)
sw: Ufunguo wa Nje (aina inaamuliwa na uwanja unaohusiana)

source: One-to-one relationship
sw: Uhusiano mmoja kwa mmoja

source: %(from)s-%(to)s relationship
sw: Uhusiano %(from)s-%(to)s

source: %(from)s-%(to)s relationships
sw: Uhusiano %(from)s-%(to)s

source: Many-to-many relationship
sw: Uhusiano wengi kwa wengi

source: This field is required.
sw: Sehemu hii ni lazima.

source: Enter a whole number.
sw: Ingiza nambari kamili.

source: Enter a valid date.
sw: Ingiza tarehe sahihi.

source: Enter a valid time.
sw: Ingiza wakati sahihi.

source: Enter a valid date/time.
sw: Ingiza tarehe/waqt sahihi.

source: Enter a valid duration.
sw: Ingiza muda sahihi.

source: The number of days must be between {min_days} and {max_days}.
sw: Idadi ya siku lazima iwe kati ya {min_days} na {max_days}.

source: No file was submitted. Check the encoding type on the form.
sw: Hakuna faili lililotumwa. Angalia aina ya encoding kwenye fomu.

source: No file was submitted.
sw: Hakuna faili lililotumwa.

source: The submitted file is empty.
sw: Faili lililotumwa ni tupu.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
sw: Hakikisha jina hili la faili lina herufi zisizozidi %(max)d (lina %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
sw: Tafadhali wasilisha faili au alamia kisanduku cha kufuta, si zote mbili.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
sw: Pakia picha halali. Faili ulilopakia halikuwa picha au lilikuwa picha iliyoharibika.

source: Select a valid choice. %(value)s is not one of the available choices.
sw: Chagua chaguo halali. %(value)s si moja ya chaguo zinazopatikana.

source: Enter a list of values.
sw: Ingiza orodha ya thamani.

source: Enter a complete value.
sw: Ingiza thamani kamili.

source: Enter a valid UUID.
sw: Ingiza UUID sahihi.

source: Enter a valid JSON.
sw: Ingiza JSON sahihi.

source: (Hidden field %(name)s) %(error)s
sw: (Uwanja uliyo fichwa %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields %(field_names)s. You may need to file a bug report if the issue persists.
sw: Data ya ManagementForm haipo au imeharibiwa. Sehemu zilizokosekana: %(field_names)s. Huenda utahitaji kuripoti hitilafu ikiwa tatizo linaendelea.

source: Please submit at most %(num)d form.
sw: Tafadhali tuma fomu zisizozidi %(num)d.

source: Please submit at least %(num)d form.
sw: Tafadhali tuma angalau fomu %(num)d.

source: Order
sw: Panga

source: Delete
sw: Futa

source: Please correct the duplicate data for %(field)s.
sw: Tafadhali sahihisha data inayojirudia kwa %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
sw: Tafadhali sahihisha data inayojirudia kwa %(field)s, ambayo lazima iwe ya kipekee.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
sw: Tafadhali sahihisha data inayojirudia kwa %(field_name)s ambayo lazima iwe ya kipekee kwa %(lookup)s katika %(date_field)s.

source: Please correct the duplicate values below.
sw: Tafadhali sahihisha thamani zinazojirudia hapa chini.

source: The inline value did not match the parent instance.
sw: Thamani ya inline haikufanana na mfano wa mzazi.

source: Select a valid choice. That choice is not one of the available choices.
sw: Chagua chaguo sahihi. Chaguo hilo si mojawapo ya chaguo zilizopo.

source: “%(pk)s” is not a valid value.
sw: “%(pk)s” si thamani sahihi.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
sw: %(datetime)s haiwezi kufasiriwa katika eneo la muda %(current_timezone)s; huenda ni kutoeleweka au haipo.

source: Clear
sw: Futa

source: Currently
sw: Kwa sasa

source: Change
sw: Badilisha

source: Unknown
sw: Haijulikani

source: Yes
sw: Ndiyo

source: No
sw: Hapana

source: yes,no,maybe
sw: ndiyo,hapana,pengine

source: %(size)d byte
sw: %(size)d bait

source: p.m.
sw: mchana

source: a.m.
sw: asubuhi

source: PM
sw: MCHANA

source: AM
sw: ASUBUHI

source: midnight
sw: usiku wa manane

source: noon
sw: mchana

source: Monday
sw: Jumatatu

source: Tuesday
sw: Jumanne

source: Wednesday
sw: Jumatano

source: Thursday
sw: Alhamisi

source: Friday
sw: Ijumaa

source: Saturday
sw: Jumamosi

source: Sunday
sw: Jumapili

source: Mon
sw: Jum

source: Tue
sw: Jtn

source: Wed
sw: Jmn

source: Thu
sw: Alh

source: Fri
sw: Iju

source: Sat
sw: Jms

source: Sun
sw: Jpl

source: March
sw: Machi

source: November
sw: Novemba

source: aug
sw: agu

source: oct
sw: okt

source: dec
sw: des

source: April
sw: Apr.

source: Aug.
sw: Aga

source: Sept.
sw: Sepet

source: Oct.
sw: Okt

source: Nov.
sw: Nove

source: Dec.
sw: Des

source: January
sw: Januari

source: February
sw: Februari

source: June
sw: Juni

source: July
sw: Julai

source: August
sw: Agosti

source: October
sw: Oktoba

source: December
sw: Desemba

source: This is not a valid IPv6 address.
sw: Ingiza anuani sahihi ya barua pepe.

source: or
sw: Au

source: %(num)d year
sw: %(num)d mwaka

source: %(num)d month
sw: %(num)d mwezi

source: %(num)d week
sw: %(num)d wiki

source: %(num)d day
sw: %(num)d siku

source: %(num)d hour
sw: %(num)d saa

source: %(num)d minute
sw: %(num)d dakika

source: Forbidden
sw: Imezuiliwa

source: CSRF verification failed. Request aborted.
sw: Uhakiki wa CSRF umeshindikana. Ombi limekatishwa.

source: You are seeing this message because this HTTPS site requires a Referer header to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
sw: Unaona ujumbe huu kwa sababu tovuti hii ya HTTPS inahitaji kichwa cha “Referer” kikitumwa na kivinjari chako, lakini hakikutumwa. Kichwa hiki kinahitajika kwa sababu za usalama, kuhakikisha kivinjari chako hakitekwa na watu wengine.

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
sw: Ikiwa umeweka kivinjari chako kuzima vichwa vya “Referer”, tafadhali iwezeshe tena, angalau kwa tovuti hii, au kwa muunganiko wa HTTPS, au kwa maombi ya “same-origin”.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
sw: Ikiwa unatumia lebo ya <meta name="referrer" content="no-referrer"> au najumuisha kichwa cha “Referrer-Policy: no-referrer”, tafadhali kiondoe. Ulinzi wa CSRF unahitaji kichwa cha “Referer” kufanya ukaguzi mkali. Ikiwa una wasiwasi kuhusu faragha, tumia mbadala kama <a rel="noreferrer" …> kwa viungo vya tovuti za watu wengine.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
sw: Unaona ujumbe huu kwa sababu tovuti hii inahitaji cookie ya CSRF wakati wa kutuma fomu. Cookie hii inahitajika kwa sababu za usalama, kuhakikisha kivinjari chako hakitekwa na watu wengine.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
sw: Ikiwa umeweka kivinjari chako kuzima cookie, tafadhali ziwezeshe tena, angalau kwa tovuti hii, au kwa maombi ya “same-origin”.

source: More information is available with DEBUG=True.
sw: Maelezo zaidi yanapatikana ikiwa DEBUG=True.

source: No year specified
sw: Hakuna mwaka uliotajwa

source: Date out of range
sw: Tarehe nje ya wigo

source: No month specified
sw: Hakuna mwezi uliotajwa

source: No day specified
sw: Hakuna siku iliyotajwa

source: No week specified
sw: Hakuna wiki iliyotajwa

source: No %(verbose_name_plural)s available
sw: Hakuna %(verbose_name_plural)s zinazopatikana

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
sw: %(verbose_name_plural)s za baadaye hazipatikani kwa sababu %(class_name)s.allow_future ni False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
sw: Kamba ya tarehe isiyo sahihi “%(datestr)s” kwa muundo “%(format)s”

source: No %(verbose_name)s found matching the query
sw: Hakuna %(verbose_name)s iliyopatikana kulingana na utafutaji

source: Page is not “last”, nor can it be converted to an int.
sw: Ukurasa si “wa mwisho”, na hauwezi kubadilishwa kuwa nambari.

source: Invalid page (%(page_number)s): %(message)s
sw: Ukurasa batili (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
sw: Orodha tupu na “%(class_name)s.allow_empty” ni False.

source: Directory indexes are not allowed here.
sw: Viashiria vya saraka haviruhusiwi hapa.

source: “%(path)s” does not exist
sw: “%(path)s” haipo

source: Index of %(directory)s
sw: Kiashiria cha %(directory)s

source: The install worked successfully! Congratulations!
sw: Usanidi umefanikiwa! Hongera!

source: You are seeing this page because
sw: Unaona ukurasa huu kwa sababu

source: Django Documentation
sw: Nyaraka za Django

source: Topics, references, &amp; how-to’s
sw: Mada, marejeo, na jinsi ya kufanya

source: Tutorial: A Polling App
sw: Kozi: Programu ya Kura

source: Get started with Django
sw: Anza na Django

source: Django Community
sw: Jumuiya ya Django

source: Connect, get help, or contribute
sw: Ungana, pata msaada, au changia

source: Total Students
sw: Jumla ya Wanafunzi

source: Passed Students (≥ {{ passing_score_threshold }})
sw: Wanafunzi Waliopitisha (≥ {{ passing_score_threshold }})

source: Failed Students (< {{ passing_score_threshold }})
sw: Wanafunzi Walioshindwa (< {{ passing_score_threshold }})

source: Overall Pass Rate
sw: Kiwango cha Kupita kwa Jumla

source: Summary for {{ overall_school_pass_fail.examination_name }}
sw: Muhtasari wa {{ overall_school_pass_fail.examination_name }}

source: Class-wise Pass/Fail Summary
sw: Muhtasari wa Kupita/Kushindwa Kila Darasa

source: Class Name
sw: Jina la Darasa

source: Passed
sw: Waliopitisha

source: Failed
sw: Walioshindwa

source: Pass Rate
sw: Kiwango cha Kupita

source: No overall school performance data available. Please ensure results are recorded.
sw: Hakuna data ya utendaji wa shule kwa jumla. Tafadhali hakikisha matokeo yameingizwa.

source: Overall Subject Averages ({{ selected_examination.name }} - {{ selected_examination.term }})
sw: Wastani wa Masomo kwa Jumla ({{ selected_examination.name }} - {{ selected_examination.term }})

source: Class-wise Subject Averages.
sw: Wastani wa Masomo Kila Darasa.

source: No subject data for this class.
sw: Hakuna data ya somo kwa darasa hili.

source: No class-wise subject averages found for this examination.
sw: Hakuna wastani wa masomo kila darasa ulio patikana kwa mtihani huu.

source: Please select an examination to generate performance analysis.
sw: Tafadhali chagua mtihani ili kutengeneza uchambuzi wa utendaji.

source: Back to Dashboard
sw: Rudi kwenye Dashibodi

source: Class Comparison for {{ examination.name }}
sw: Ulinganifu wa Darasa kwa {{ examination.name }}

source: No data found for this examination.
sw: Hakuna data iliyopatikana kwa mtihani huu.

source: Class Performance Summary
sw: Muhtasari wa Utendaji wa Darasa

source: Did not attempt exam
sw: Hawajajaribu mtihani

source: Top/Bottom
sw: Bora/Chini

source: Not Attempted
sw: Hawajajaribu

source: No classes found to generate a performance summary.
sw: Hakuna madarasa yaliyopatikana kuunda muhtasari wa utendaji.

source: Graduated Students
sw: Wanafunzi Waliohitimu

source: Select Year:
sw: Chagua Mwaka:

source: View
sw: Angalia

source: Please select a year to view graduated students.
sw: Tafadhali chagua mwaka kuangalia wanafunzi waliyo hitimu.

source: No graduated students found for year.
sw: Hakuna wanafunzi waliyo hitimu waliopatikana kwa mwaka.

source: Students Who Didn't Attempt Exam - {{ class_name }}
sw: Wanafunzi Ambaye Hawajakamilisha Mtihani - {{ class_name }}

source: All students in <strong>{{ class_name }}</strong> have attempted the exam 🎉
sw: Wanafunzi wote wa <strong>{{ class_name }}</strong> wamejaribu mtihani 🎉

source: Student Name
sw: Jina la Mwanafunzi

source: Gender
sw: Jinsia

source: Top and Bottom Students
sw: Wanafunzi Bora na Chini

source: Bottom 10 Students
sw: Wanafunzi 10 Chini

source: Average
sw: Kiwango cha Kawaida

source: Are you sure you want to delete the class: <strong>{{ class_obj.name }} ({{ class_obj.year }})</strong>?
sw: Una uhakika unataka kufuta darasa: <strong>{{ class_obj.name }} ({{ class_obj.year }})</strong>?

source: Warning: There are students assigned to this class. You must reassign or delete them before deleting this class.
sw: Onyo: Kuna wanafunzi walioteuliwa kwenye darasa hili. Lazima uwaweke katika darasa jingine au uwafute kabla ya kufuta darasa hili.

source: Not Assigned
sw: Haijawekwa

source: Class Performance Analysis - {{ class_obj.name }} - Kabage Primary School
sw: Uchambuzi wa Utendaji wa Darasa - {{ class_obj.name }} - Shule ya Msingi

source: Class Performance Analysis
sw: Uchambuzi wa Utendaji wa Darasa

source: Detailed performance overview for the selected class and examination.
sw: Muhtasari wa kina wa utendaji kwa darasa na mtihani uliyochaguliwa.

source: No results found for this class and examination. Please ensure marks have been entered.
sw: Hakuna matokeo yaliyopatikana kwa darasa hili na mtihani. Tafadhali hakikisha alama zimeingizwa.

source: Are you sure you want to delete the examination: <strong>{{ examination.name }} ({{ examination.academic_year }} {{ examination.get_term_display }})</strong>?
sw: Una uhakika unataka kufuta mtihani: <strong>{{ examination.name }} ({{ examination.academic_year }} {{ examination.get_term_display }})</strong>?

source: Warning: This examination has marks recorded. You must delete marks for this examination first.
sw: Onyo: Mtihani huu una alama zilizorekodiwa. Lazima ufute alama za mtihani huu kwanza.

source: Effortlessly select parameters to enter or manage student marks.
sw: Chagua vigezo kwa urahisi ili kuingiza au kusimamia alama za wanafunzi.

source: Efficiently upload student marks using a pre-formatted Excel spreadsheet.
sw: Pakia alama za wanafunzi kwa urahisi ukitumia faili la Excel lililopangwa tayari.

source: Your Excel file (.xlsx format) should have the following exact column headers in the first row:
sw: Faili lako la Excel (.xlsx) linapaswa kuwa na vichwa vya safu vifuatavyo kwenye mstari wa kwanza:

source: Score
sw: Alama

source: Existing marks for the same student, subject, and examination will be
sw: Alama zilizopo kwa mwanafunzi, somo, na mtihani sawa zitasasishwa.

source: View Marks
sw: Tazama Alama

source: No students assigned to your class yet, or you are not assigned to a class.
sw: Hakuna wanafunzi waliopangiwa darasa lako bado, au hujapangiwa darasa.

source: No subject marks recorded for this student in this examination.
sw: Hakuna alama za somo zilizorekodiwa kwa mwanafunzi huyu katika mtihani huu.

source: Please upload an Excel file (.xlsx or .xls) containing student data. The file should have the following exact column headers in the first row:
sw: Tafadhali pakia faili la Excel (.xlsx au .xls) linalojumuisha data za wanafunzi. Faili linapaswa kuwa na vichwa vya safu kama ifuatavyo kwenye safu ya kwanza:

source: If a 'Class Name' and 'Class Year' combination does not exist, it will be created automatically with no assigned class teacher initially.
sw: Iwapo mchanganyiko wa 'Jina la Darasa' na 'Mwaka wa Darasa' haupo, taundwa kiotomatiki bila mwalimu wa darasa aliyepangwa kwa awali.
