Repository: ngraaiyo/sibwesa_primary_school
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: Are you sure you want to delete the student: <strong>{{ student.first_name }} {% if student.middle_name %} {{ student.middle_name }} {% endif %}{{ student.last_name }}</strong> (Prem No: {{ student.prem_number }})?
sw: Una uhakika unataka kufuta mwanafunzi: <strong>{{ student.first_name }} {% if student.middle_name %}{{ student.middle_name }} {% endif %} {{ student.last_name }}</strong> (Namba ya Prem: {{ student.prem_number }})?

source: Welcome, Class Teacher {{ request.user.username }}! Here are the students in your assigned class and all students in the school.
sw: Karibu, Mwalimu wa Darasa {{ request.user.username }}! Hapa kuna wanafunzi waliopo darasani mwako na wanafunzi wote shuleni.

source: Students in My Class: {% if assigned_class_name %}{{ assigned_class_name }}{% else %}Not Assigned{% endif %}
sw: Wanafunzi Walioko Darasani Mwangu: {% if assigned_class_name %}{{ assigned_class_name }}{% else %}Haijapangwa{% endif %}

source: No students found for this view.
sw: Hakuna wanafunzi waliopatikana kwa mtazamo huu.

source: Are you sure you want to delete the subject: <strong>{{ subject.name }} ({{ subject.code }})</strong>?
sw: Una uhakika unataka kufuta somo: <strong>{{ subject.name }} ({{ subject.code }})</strong>?

source: Warning: This subject is linked to existing examinations or marks. You must delete or reassign those records first.
sw: Onyo: Somo hili lina uhusiano na mitihani au alama zilizopo. Lazima ufute au upange upya rekodi hizo kwanza.

source: Save Subject
sw: Hifadhi Somo

source: Subject List - Kabage Primary School
sw: Orodha ya Masomo - Shule ya Msingi Kabage

source: Subject Management
sw: Usimamizi wa Masomo

source: Add New Subject
sw: Ongeza Somo Jipya

source: Subject Name
sw: Jina la Somo

source: Subject Code
sw: Nambari ya Somo

source: No subjects found.
sw: Hakuna masomo yaliyopatikana.

source: Upload Students Excel
sw: Pakia Wanafunzi Excel

source: Bulk Upload Students
sw: Pakia Wanafunzi Wengi Mara Moja

source: Use this page to bulk upload student information from an Excel file.
sw: Tumia ukurasa huu kupakia taarifa za wanafunzi wengi mara moja kutoka kwenye faili la Excel.

source: Upload Excel
sw: Pakia Excel

source: Excel File Format Requirements:
sw: Mahitaji ya Muundo wa Faili la Excel:

source: Your Excel file should have the following column headers (case-insensitive, but match these for best results):
sw: Faili lako la Excel linapaswa kuwa na vichwa vya safu vifuatavyo (hakikisha vinafanana, si kufuata herufi kubwa au ndogo):

source: Need a template? Download our sample Excel file to ensure correct column headers and format:
sw: Unahitaji kiolezo? Pakua faili yetu ya mfano wa Excel ili kuhakikisha vichwa vya safu na muundo ni sahihi:

source: Download Sample Template
sw: Pakua Kiolezo cha Mfano

source: first_name
sw: jina_la_kwanza

source: middle_name
sw: jina_la_kati

source: last_name
sw: jina_la_mwisho

source: date_of_birth
sw: tarehe_ya_kuzaliwa

source: gender
sw: jinsia

source: Prem_number
sw: namba_ya_prem

source: current_class_name
sw: jina_la_darasa_sasa

source: Required
sw: Inahitajika

source: Optional
sw: Hiari

source: Any rows with missing required data or non-existent classes will be skipped. Review warnings after upload.
sw: Safu yoyote yenye data muhimu iliyokosekana au madarasa yasiyo ya kweli itapita. Kagua onyo baada ya kupakia.

source: Student Information
sw: Taarifa za Wanafunzi

source: View Class Students
sw: Tazama Wanafunzi wa Darasa

source: View All Students
sw: Tazama Wanafunzi Wote

source: Promotion & Graduation
sw: Kupandishwa Madaraja & Kuahirishwa

source: Mark Management
sw: Usimamizi wa Alama

source: Enter Class Marks
sw: Ingiza Alama za Darasa

source: View Class Marks
sw: Tazama Alama za Darasa

source: Enter Marks
sw: Ingiza Alama

source: View All Marks
sw: Tazama Alama Zote

source: Enter/Edit Marks
sw: Ingiza/Hariri Alama

source: Performance & Results
sw: Utendaji & Matokeo

source: Generate Results
sw: Tengeneza Matokeo

source: View Performance
sw: Tazama Ufanisi

source: Examination Analysis
sw: Uchambuzi wa Mtihani

source: Teacher Management
sw: Usimamizi wa Walimu

source: View All Teachers
sw: Tazama Walimu Wote

source: Add/Manage Teachers
sw: Ongeza/Simamia Walimu

source: Reporting
sw: Utoaji Ripoti

source: My Class: Not Attempted Exam
sw: Darasa Langu: Hakujaribu Mtihani

source: My Class: Top and Bottom
sw: Darasa Langu: Bora na Duni

source: All Classes: Not Attempted Exam
sw: Madraso Yote: Hakujaribu Mtihani

source: All Classes: Top and Bottom
sw: Madraso Yote: Bora na Duni

source: Class Comparison
sw: Ulinganifu wa Madarasa

source: Student Trend (on Student Profile)
sw: Mwelekeo wa Mwanafunzi (kwa Wasifu wa Mwanafunzi)

source: Timetable & Attendance
sw: Ratiba & Mahudhurio

source: Mark Attendance
sw: Weka Mahudhurio

source: View Timetable
sw: Tazama Ratiba

source: Male User Icon
sw: Ikoni ya Mtumiaji Mwanaume

source: Female User Icon
sw: Ikoni ya Mtumiaji Mwanamke

source: Login to
sw: Ingia kwenye

source: Don't have an account?
sw: Huna akaunti?

source: Register here
sw: Jisajili hapa

source: Forgot your password?
sw: Umesahau nenosiri lako?

source: Reset Password
sw: Weka Upya Nenosiri

source: Back to Login
sw: Rudi kwenye Ingia

source: Save Teacher
sw: Hifadhi Mwalimu

source: Update Teacher
sw: Sasisha Mwalimu

source: Cancel
sw: Ghairi

source: Add New Teacher
sw: Ongeza Mwalimu Mpya

source: Confirm Deletion
sw: Thibitisha Ufafanuzi

source: Are you sure you want to delete
sw: Una uhakika unataka kufuta

source: This action cannot be undone.
sw: Kitendo hiki hakiwezi kubadilishwa.

source: Total Teachers:
sw: Jumla ya Walimu:

source: No teacher accounts found. Click "Add New Teacher" to get started!
sw: Hakuna akaunti za walimu zilizopatikana. Bonyeza "Ongeza Mwalimu Mpya!

source: Edit Teacher
sw: Hariri Mwalimu

source: Swahili
sw: Kiswahili

source: Delete Teacher
sw: Futa Mwalimu

source: Welcome,
sw: Karibu,

source: Pending User Approvals
sw: Idhini za Watumiaji Walioko Kusubiri

source: View Pending Users
sw: Angalia Watumiaji Walioko Kusubiri

source: Quick Links
sw: Viungo vya Haraka

source: Go to Django Admin Panel
sw: Nenda kwenye Paneli ya Msimamizi ya Django

source: Manage All Students
sw: Simsamie Wanafunzi Wote

source: Manage All Classes
sw: Simsamie Madarasa Yote

source: Manage All Subjects
sw: Simsamie Masomo Yote

source: Manage All Exams
sw: Simsamie Mitihani Yote

source: Enter Marks (Manual/Bulk)
sw: Weka Alama (Kibinafsi/Kikundi)

source: Generate Student Results
sw: Tengeneza Matokeo ya Wanafunzi

source: Manage School Notifications
sw: Simsamie Arifa za Shule

source: Promote/Graduate Students
sw: Pandisha/Kuwawezesha Wanafunzi Kuhitimu

source: Register New Account
sw: Jisajili Akaunti Mpya

source: Register
sw: Jisajili

source: Already have an account?
sw: Tayari una akaunti?

source: Login here
sw: Ingia hapa

source: Passwords do not match.
sw: Manenosiri hayalingani.

source: Teacher Dashboard Overview
sw: Muhtasari wa Dashibodi ya Mwalimu

source: Boys
sw: Wavulana

source: Girls
sw: Wasichana

source: Registered in school
sw: Waliyojiandikisha Shuleni

source: Documents for School
sw: Hati za Shule

source: Download
sw: Pakua

source: View Link
sw: Tazama Kiungo

source: No documents or announcements available.
sw: Hakuna hati au matangazo yanayopatikana.

source: School Calendar
sw: Kalenda ya Shule

source: Add Note to Calendar
sw: Ongeza Kumbuka kwenye Kalenda

source: Date
sw: Tarehe

source: Note
sw: Kumbuka

source: Enter your note here...
sw: Ingiza kumbuka yako hapa...

source: Save Note
sw: Hifadhi Kumbuka

source: Students
sw: Wanafunzi

source: In My Class(es)
sw: Wanafunzi wa Darasa Langu

source: Female Students
sw: Wasichana

source: Male Students
sw: Wavulana

source: Notifications
sw: Taarifa

source: No new notifications.
sw: Hakuna arifa mpya.

source: From: %(from)s / %(timesince)s ago
sw: Kutoka: %(from)s / %(timesince)s iliyopita
